{"config": {"name": "model_24", "output_layers": [["YT", 0, 0], ["YP", 0, 0]], "layers": [{"name": "XT", "inbound_nodes": [], "config": {"dtype": "float32", "batch_input_shape": [null, 399, 21], "name": "XT", "sparse": false}, "class_name": "InputLayer"}, {"name": "XP", "inbound_nodes": [], "config": {"dtype": "float32", "batch_input_shape": [null, 399, 50], "name": "XP", "sparse": false}, "class_name": "InputLayer"}, {"name": "MT", "inbound_nodes": [[["XT", 0, 0, {}]]], "config": {"name": "MT", "trainable": true, "mask_value": 0.0}, "class_name": "Masking"}, {"name": "MP", "inbound_nodes": [[["XP", 0, 0, {}]]], "config": {"name": "MP", "trainable": true, "mask_value": 0.0}, "class_name": "Masking"}, {"name": "MergeX", "inbound_nodes": [[["MT", 0, 0, {}], ["MP", 0, 0, {}]]], "config": {"name": "MergeX", "axis": -1, "trainable": true}, "class_name": "Concatenate"}, {"name": "HiddenLayer1_1", "inbound_nodes": [[["MergeX", 0, 0, {}]]], "config": {"kernel_regularizer": null, "recurrent_regularizer": null, "trainable": true, "units": 71, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "name": "HiddenLayer1_1", "return_sequences": true, "go_backwards": false, "activity_regularizer": null, "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "dropout": 0.0, "unroll": false, "activation": "tanh", "bias_constraint": null, "recurrent_constraint": null, "use_bias": true, "stateful": false, "return_state": false, "bias_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "recurrent_dropout": 0.0}, "class_name": "SimpleRNN"}, {"name": "HiddenLayer", "inbound_nodes": [[["HiddenLayer1_1", 0, 0, {}]]], "config": {"kernel_regularizer": null, "recurrent_regularizer": null, "trainable": true, "units": 23, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "name": "HiddenLayer", "return_sequences": true, "go_backwards": false, "activity_regularizer": null, "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "dropout": 0.0, "unroll": false, "activation": "tanh", "bias_constraint": null, "recurrent_constraint": null, "use_bias": true, "stateful": false, "return_state": false, "bias_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "recurrent_dropout": 0.0}, "class_name": "SimpleRNN"}, {"name": "YT", "inbound_nodes": [[["HiddenLayer", 0, 0, {}]]], "config": {"name": "YT", "layer": {"config": {"kernel_regularizer": null, "units": 21, "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "name": "dense_13", "use_bias": true, "kernel_constraint": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "activation": "softmax"}, "class_name": "Dense"}, "trainable": true}, "class_name": "TimeDistributed"}, {"name": "YP", "inbound_nodes": [[["HiddenLayer", 0, 0, {}]]], "config": {"name": "YP", "layer": {"config": {"kernel_regularizer": null, "units": 50, "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "name": "dense_14", "use_bias": true, "kernel_constraint": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "activation": "softmax"}, "class_name": "Dense"}, "trainable": true}, "class_name": "TimeDistributed"}], "input_layers": [["XT", 0, 0], ["XP", 0, 0]]}, "class_name": "Model", "keras_version": "2.1.4", "backend": "tensorflow"}